In [3]:
import requests
import pandas as pd
import matplotlib as mpl

url = 'https://data.cityofnewyork.us/api/views/7yc5-fec2/rows.csv'
url_file = requests.get(url)

print('Status code:', url_file.status_code)

Status code: 200

In [4]:
dataset = pd.read_csv(url)
dataset.head()

,DBN,School Name,Category,Year,Total Enrollment,#Grade K,#Grade 1,#Grade 2,#Grade 3,#Grade 4,...,MATH #Level 1,MATH %Level 1,MATH #Level 2,MATH %Level 2,MATH #Level 3,MATH %Level 3,MATH #Level 4,MATH %Level 4,MATH #L3+L4,MATH %L3 + L4
0,01M015,P.S. 015 Roberto Clemente,All Students,2015-16,162.0,32,33,39,23,17,...,25,0.46296296296296297,18,0.3333333333333333,s,s,s,s,11,0.2037037037037037
1,01M015,P.S. 015 Roberto Clemente,Attend school outside district of residence,2015-16,37.0,7,7,11,7,s,...,s,s,s,s,s,s,s,s,s,s
2,01M015,P.S. 015 Roberto Clemente,English Language Learners,2015-16,16.0,s,s,s,s,s,...,s,s,s,s,s,s,s,s,s,s
3,01M015,P.S. 015 Roberto Clemente,Poverty,2015-16,162.0,32,33,39,23,17,...,25,0.46296296296296297,18,0.3333333333333333,s,s,s,s,11,0.2037037037037037
4,01M015,P.S. 015 Roberto Clemente,Reside in temporary housing,2015-16,65.0,12,14,17,10,s,...,11,0.5238095238095238,6,0.2857142857142857,s,s,s,s,s,s

In [5]:
df = pd.DataFrame(dataset, columns=['School Name', 'Category', 'Total Enrollment', '#Female', '#Male'])

df.head()

,School Name,Category,Total Enrollment,#Female,#Male
0,P.S. 015 Roberto Clemente,All Students,162.0,79,83
1,P.S. 015 Roberto Clemente,Attend school outside district of residence,37.0,24,13
2,P.S. 015 Roberto Clemente,English Language Learners,16.0,7,9
3,P.S. 015 Roberto Clemente,Poverty,162.0,79,83
4,P.S. 015 Roberto Clemente,Reside in temporary housing,65.0,26,39

In [6]:
df.columns = [title.lower().replace(" ", "_").replace("#", "") for title in df.columns]
df.columns

Index(['school_name', 'category', 'total_enrollment', 'female', 'male'], dtype='object')

In [7]:
df.dtypes

school_name          object
category             object
total_enrollment    float64
female               object
male                 object
dtype: object

In [8]:
df1 = df.dropna()
df.isnull().sum()

school_name           6
category              0
total_enrollment    223
female                0
male                  0
dtype: int64

In [9]:
df1.isnull().sum()

school_name         0
category            0
total_enrollment    0
female              0
male                0
dtype: int64

In [10]:
df1 = df1.drop(df1[(df1.total_enrollment == 's') | (df1.female == 's') | (df1.male == 's')].index)

In [11]:
datatypes = {'school_name': str,
            'category': str,
            'total_enrollment': int,
            'female': int,
            'male': int}

df1 = df1.astype(datatypes)
df1.dtypes

school_name         object
category            object
total_enrollment     int32
female               int32
male                 int32
dtype: object

In [12]:
df1.head()

,school_name,category,total_enrollment,female,male
0,P.S. 015 Roberto Clemente,All Students,162,79,83
1,P.S. 015 Roberto Clemente,Attend school outside district of residence,37,24,13
2,P.S. 015 Roberto Clemente,English Language Learners,16,7,9
3,P.S. 015 Roberto Clemente,Poverty,162,79,83
4,P.S. 015 Roberto Clemente,Reside in temporary housing,65,26,39

In [20]:
df2 = pd.DataFrame(df1, columns=["school_name"])
df2.drop_duplicates(inplace=True, ignore_index=True)
df2

                                        school_name
0                         P.S. 015 Roberto Clemente
1                               P.S. 019 Asher Levy
2                              P.S. 020 Anna Silver
3                         School for Global Leaders
4                    P.S. 034 Franklin D. Roosevelt
...                                             ...
1143             P.S. 377 Alejandrina B. De Gautier
1144                   J.H.S. 383 Philippa Schuyler
1145               P.S. /I.S. 384 Frances E. Carter
1146           All City Leadership Secondary School
1147  Evergreen Middle School for Urban Exploration

[1148 rows x 1 columns]

In [ ]:
df3 = pd.DataFrame(df1, columns=["category"])
df3.drop_duplicates(inplace=True, ignore_index=True)
df3